Repository: M1n01/ft_transcendence
Catalog: django/backend/localization/*/LC_MESSAGES/django.po
Languages: fr, ja

# 10. お問い合わせ
source: 10. Contact us
fr: 10. Nous contacter
ja: 10. お問い合わせ

# プライバシーポリシーに関するご質問や、利用者の権利の行使に関するお問い合わせは、以下の連絡先までお願いいたします：
source: For questions regarding the privacy policy or inquiries about exercising user rights, please contact us at the following address:
fr: Pour toute question concernant la politique de confidentialité ou des demandes liées à l'exercice des droits des utilisateurs, veuillez nous contacter à l'adresse suivante:
ja: プライバシーポリシーに関するご質問や、利用者の権利の行使に関するお問い合わせは、以下の連絡先までお願いいたします：

# 連絡先： [連絡先情報]
source: contact: [contact info]
fr: Contact: [coordonnées]
ja: 連絡先： [連絡先情報]

# メール： [メールアドレス]
source: email: [email address]
fr: Email: [adresse e-mail]
ja: メール： [メールアドレス]

# 電話番号： [電話番号]
source: Telphone number: [telphone number]
fr: Numéro de téléphone: [numéro de téléphone]
ja: 電話番号： [電話番号]

# トップ画面に戻る
source: Return to the home screen
fr: Retour à l'écran d'accueil
ja: トップ画面に戻る

# 勝敗
source: Wins/Total matches
fr: Victoires / Total des matchs
ja: 勝敗

# 最終更新日時
source: Last update
fr: Dernière mise à jour
ja: 最終更新日時

# 最終ログイン日時
source: Last login
fr: Dernière connexion
ja: 最終ログイン日時

# 編集
source: Edit
fr: Modifier
ja: 編集

source: Delete
fr: Supprimer
ja: 消す

# パスワードの変更
source: Change password
fr: Changer le mot de passe
ja: パスワードの変更

# プロフィールのエクスポート
source: Export your profile
fr: Exporter votre profil
ja: プロフィールのエクスポート

# アカウント削除
source: Account deletion
fr: Suppression du compte
ja: アカウント削除

# アカウント削除します。
source: Your account will be deleted.
fr: Votre compte sera supprimé.
ja: アカウント削除します。

# 復旧することはできません。
source: It cannot be recovered.
fr: Il ne pourra pas être récupéré.
ja: 復旧することはできません。

# 削除
source: Delete
fr: Supprimer
ja: 削除

source: email
ja: メールアドレス

# アバター
source: Avatar
ja: アバター

# はい
source: OK
ja: はい

# メッセージ
source: Messages
ja: メッセージ

# 通知
source: Notifications
ja: 通知
