Repository: M1n01/ft_transcendence
Catalog: django/backend/localization/*/LC_MESSAGES/django.po
Languages: fr, ja

# password(確認用)
source: Password (For confirmation)
fr: password(確認用)
ja: password(確認用)

# このメールアドレスは既に使用されています。......
source: This email address is already in use.......
fr: Cette adresse e-mail est déjà utilisée.
ja: このメールアドレスは既に使用されています。......

# 数値以外は記入しないでください
source: Please enter numbers only.
fr: Veuillez ne pas entrer de valeurs non numériques.
ja: 数値以外は記入しないでください

# 正しい電話番号を入力してください
source: Please enter a valid phone number.
fr: Veuillez entrer un numéro de téléphone valide.
ja: 正しい電話番号を入力してください

# この電話番号は既に使用されています。......
source: This phone number is already in use.......
fr: Ce numéro de téléphone est déjà utilisé.
ja: この電話番号は既に使用されています。......

# 64文字以内にしてください
source: Must be under 64 characters.
fr: Veuillez entrer moins de 64 caractères.
ja: 64文字以内にしてください

# 20文字以内にしてください
source: Must be under 20 characters.
fr: Veuillez entrer moins de 20 caractères.
ja: 20文字以内にしてください

# 8文字以上にしてください
source: Must be at least 8 characters.
fr: Veuillez entrer au moins 8 caractères.
ja: 8文字以上にしてください

# 日本語
source: Japanese
fr: Japonais
ja: 日本語

# 英語
source: English
fr: Anglais
ja: 英語

# フランス語
source: French
fr: Français
ja: フランス語

# ユーザー名
source: Username
fr: Nom d'utilisateur
ja: ユーザー名

# 姓
source: Last name
fr: Nom de famille
ja: 姓

# 名
source: First name
fr: Prénom
ja: 名

# 国番号
source: Country code
fr: Code pays
ja: 国番号

# 電話番号
source: Phone number
fr: Numéro de téléphone
ja: 電話番号

# 言語設定
source: Language select
fr: Paramètres de langue
ja: 言語設定

# 誕生日
source: Birthday
fr: Anniversaire
ja: 誕生日

# 2要素認証
source: 2 Factor authentication method
fr: Authentification à deux facteurs
ja: 2要素認証

# App鍵
source: App key
fr: Clé d'application
ja: App鍵

# 続けて認証ボタンを押すことでログインされます
source: Then press the authenticate button.
fr: Appuyez ensuite sur le bouton d'authentification pour vous connecter.
ja: 続けて認証ボタンを押すことでログインされます

# 認証中です。
source: Authentication in progress.
fr: Authentification en cours.
ja: 認証中です。

# しばらくお待ちください
source: Please wait for a moment.
fr: Veuillez patienter un instant.
ja: しばらくお待ちください

# 認証に失敗しました。
source: Authentication failed.
fr: L'authentification a échoué.
ja: 認証に失敗しました。

# 最初からやり直してください
source: Please start over.
fr: Veuillez recommencer.
ja: 最初からやり直してください

# 認証
source: Authenticate
fr: Authentifier
ja: 認証

source: Login/Signup
fr: Connexion/Inscription
ja: ログイン/サインアップ

# このサイトではCookieを使用しています。詳細は
source: This website uses cookies. For further information, please read
fr: Ce site utilise des cookies. Pour plus d'informations, veuillez lire
ja: このサイトではCookieを使用しています。詳細は

# プライバシーポリシー
source: Privacy Policy
fr: Politique de confidentialité
ja: プライバシーポリシー

source: Log_out
fr: Déconnexion
ja: ログアウト

source: Email address
fr: Adresse e-mail
ja: メールアドレス

source: Password
fr: Mot de passe
ja: パスワード

source: Log_in
fr: Connexion
ja: ログイン

# 元に戻す
source: Reset
fr: Réinitialiser
ja: 元に戻す

# 入力内容を見直してください
source: Please review the entered information.
fr: Veuillez vérifier les informations saisies.
ja: 入力内容を見直してください

# 認証完了しました
source: Authentication completed.
fr: L'authentification est terminée.
ja: 認証完了しました

# このページは閉じ、元のページに戻ってください
source: Please close this page.
fr: Veuillez fermer cette page.
ja: このページは閉じ、元のページに戻ってください

# 氏
source: Last Name
fr: Nom de famille
ja: 氏

# 生年月日
source: Birth date
fr: Date de naissance
ja: 生年月日

# 国コード
source: Country code
fr: Code du pays
ja: 国コード

# 2要素認証方法
source: 2 Factor authentication method
fr: Méthode d'authentification à deux facteurs
ja: 2要素認証方法

# 言語
source: Language
fr: Langue
ja: 言語

# パスワード
source: Password
fr: Mot de passe
ja: パスワード

# パスワード(確認用)
source: Password (Confirmation)
fr: Mot de passe (confirmation)
ja: パスワード(確認用)

# 認証コードの送信に失敗しました
source: Authentication code failed to send.
fr: Échec de l'envoi du code d'authentification.
ja: 認証コードの送信に失敗しました

# 入力した内容を見直して再度実行してください
source: Please review the entered information and retry.
fr: Veuillez vérifier les informations saisies et réessayer.
ja: 入力した内容を見直して再度実行してください

# サインアップ
source: Sign up
fr: S'inscrire
ja: サインアップ

# 2要素認証をSMSにする場合、電話番号を入力してください
source: If you selected SMS as your 2 factor authentication method, please enter a phone number
fr: Si vous avez sélectionné SMS comme méthode d'authentification à deux facteurs, veuillez entrer un numéro de téléphone.
ja: 2要素認証をSMSにする場合、電話番号を入力してください

# サーバー内でエラーが発生しました。
source: Server error.
fr: Erreur de serveur.
ja: サーバー内でエラーが発生しました。

# 記入内容を見直して、もう一度最初から実行してください
source: Please review the entered information and retry.
fr: Veuillez vérifier les informations et recommencer.
ja: 記入内容を見直して、もう一度最初から実行してください

# 認証コードを入力してください
source: Please enter the authentication code.
fr: Veuillez entrer le code d'authentification.
ja: 認証コードを入力してください

# 認証に失敗しました
source: Authentication failed.
fr: L'authentification a échoué.
ja: 認証に失敗しました

# 認証コードを見直して再度実行してください
source: Please check the authentication code again and try again.
fr: Veuillez vérifier le code d'authentification et réessayer.
ja: 認証コードを見直して再度実行してください

# 認証コード
source: Authentication code
fr: Code d'authentification
ja: 認証コード

# キャンセル
source: Cancel
fr: Annuler
ja: キャンセル

source: pending
fr: en attente
ja: 保留中

source: accepted
fr: accepté
ja: 承認済み

source: block
fr: bloquer
ja: ブロック

source: blocked
fr: bloqué
ja: ブロック中

# ユーザー
source: Username
fr: nom d'utilisateur
ja: ユーザー

# フレンド
source: Friends
fr: Amis
ja: フレンド

# 状態
source: Status
fr: Statut
ja: 状態

# 作成日時
source: Creation date
fr: Date de création
ja: 作成日時

# 変更日時
source: Date of edit
fr: Date de modification
ja: 変更日時

# ブロック
source: Block
fr: Bloquer
ja: ブロック

# このユーザーをブロックします
source: Delete this user
fr: Bloquer cet utilisateur
ja: このユーザーをブロックします

# エラーが発生しました。
source: An error occured.
fr: Une erreur s'est produite.
ja: エラーが発生しました。

# このダイアログを削除し、もう一度実行してください
source: Please close this message and try again
fr: Veuillez fermer ce message et réessayer
ja: このダイアログを削除し、もう一度実行してください

source: リクエスト許可
fr: Autoriser la demande

# このユーザーをフレンドに追加します
source: Add user as friend
fr: Ajouter cet utilisateur comme ami
ja: このユーザーをフレンドに追加します

# 登録
source: Sign up
fr: S'inscrire
ja: 登録

# ブロックリスト
source: Blocked list
fr: Liste des utilisateurs bloqués
ja: ブロックリスト

source: Top
fr: Haut
ja: トップ

source: Previous
fr: Précédent
ja: 前

source: Next
fr: Suivant
ja: 次へ

source: Last
fr: Dernier
ja: 最後

# ブロックしたユーザーはいません
source: No blocked users
fr: Aucun utilisateur bloqué
ja: ブロックしたユーザーはいません

# すべてのブロックしたユーザーを表示
source: Show all blocked users
fr: Afficher tous les utilisateurs bloqués
ja: すべてのブロックしたユーザーを表示

# ブロックしたユーザーはいません.
source: No blocked users
fr: Aucun utilisateur bloqué.
ja: ブロックしたユーザーはいません.

# オンライン
source: Online
fr: En ligne
ja: オンライン

# オフライン
source: Offline
fr: Hors ligne
ja: オフライン

# フレンドリスト
source: Friends list
fr: Liste d'amis
ja: フレンドリスト

# フレンドはいません
source: No friends
fr: Aucun ami
ja: フレンドはいません

source: Friend
fr: Ami
ja: フレンド

# すべてのフレンドを表示
source: Show all friends
fr: Afficher tous les amis
ja: すべてのフレンドを表示

# 許可
source: Allow
fr: Autoriser
ja: 許可

# フレンドリクエスト
source: Friend Requests
fr: Demandes d'amis
ja: フレンドリクエスト

# フレンドリクエストはありません
source: No friend requests
fr: Aucune demande d'ami
ja: フレンドリクエストはありません

# エラーが発生しました
source: An error occured.
fr: Une erreur s'est produite.
ja: エラーが発生しました

source: 相手がすでに登録したかもしれません
fr: Cet utilisateur peut déjà être enregistré

# フレンドリクエストを確認してください
source: Please check your friend requests
fr: Veuillez vérifier vos demandes d'amis
ja: フレンドリクエストを確認してください

# 申請
source: Request
fr: Demande
ja: 申請

# すべてのリクエストを表示
source: Show all requests
fr: Afficher toutes les demandes
ja: すべてのリクエストを表示

# フレンド候補を探す
source: Search for friend
fr: Rechercher un ami
ja: フレンド候補を探す

# 検索結果
source: Search results
fr: Résultats de la recherche
ja: 検索結果

# フレンド申請
source: Friend request
fr: Demande d'ami
ja: フレンド申請

source: Japanese
fr: Japonais
ja: 日本語

source: English
fr: Anglais
ja: 英語

source: French
fr: Français
ja: フランス語

# ドロー
source: Draw
fr: Match nul
ja: ドロー

# 無効試合
source: Invalid match
fr: Match invalide
ja: 無効試合

# 勝利
source: Victory
fr: Victoire
ja: 勝利

# 敗北
source: Defeat
fr: Défaite
ja: 敗北

# 該当試合はありません
source: No relevant matches
fr: Aucun match pertinent
ja: 該当試合はありません

# 対象の試合はありません
source: No relevant matches
fr: Aucun match pertinent
ja: 対象の試合はありません

# すべての試合を表示
source: Show all matches
fr: Afficher tous les matchs
ja: すべての試合を表示

# トーナメント
source: Tournament
fr: Tournoi
ja: トーナメント

# 作成日
source: Creation date
fr: Date de création
ja: 作成日

# 有効期限
source: Validity period
fr: Date d'expiration
ja: 有効期限

# 変更日
source: Modification date
fr: Date de modification
ja: 変更日

# プレイヤー1 エイリアス名
source: Player 1 alias
fr: Alias du joueur 1
ja: プレイヤー1 エイリアス名

# プレイヤー2 エイリアス名
source: Player 2 alias
fr: Alias du joueur 2
ja: プレイヤー2 エイリアス名

# 主催者
source: Host
fr: Hôte
ja: 主催者

# プレイヤー1
source: Player 1
fr: Joueur 1
ja: プレイヤー1

# プレイヤー2
source: Player 2
fr: Joueur 2
ja: プレイヤー2

# 開始日時
source: Start date and time
fr: Date et heure de début
ja: 開始日時

# 開始
source: Start
fr: Démarrer
ja: 開始

# 詳細
source: Details
fr: Détails
ja: 詳細

source: Game
fr: Jeu
ja: ゲーム

# テストゲーム
source: Test game
fr: Jeu de test
ja: テストゲーム

# スタート
source: Start
fr: Démarrer
ja: スタート

# 実行できるトーナメントがありません
source: No tournaments to run
fr: Aucun tournoi à exécuter
ja: 実行できるトーナメントがありません

# 詳細
source: Details
fr: Détails
ja: 詳細

# ゲームの開始に失敗しました。
source: Failed to start game.
fr: Échec du démarrage du jeu.
ja: ゲームの開始に失敗しました。

# ページを更新して再度実行してください
source: Please refresh the page and try again.
fr: Veuillez rafraîchir la page et réessayer.
ja: ページを更新して再度実行してください

# サーバーとの通信に失敗しました
source: Server connection failure
fr: Échec de connexion au serveur.
ja: サーバーとの通信に失敗しました

# 画面を更新してください
source: Please refresh the page
fr: Veuillez rafraîchir la page.
ja: 画面を更新してください

# 戻る
source: Back
fr: Retour
ja: 戻る

source: not_change
fr: pas_changé
ja: 変更しない

# 指定するページにアクセスするにはログインする必要があります
source: You must login to access the selected page
fr: Vous devez vous connecter pour accéder à la page sélectionnée.
ja: 指定するページにアクセスするにはログインする必要があります

# ログインページ
source: Login page
fr: Page de connexion
ja: ログインページ

# ゲーム
source: Game
fr: Jeu
ja: ゲーム

# 履歴
source: History
fr: Historique
ja: 履歴

# プロフィール
source: Profile
fr: Profil
ja: プロフィール

# ログアウト
source: Log out
fr: Déconnexion
ja: ログアウト

# 最大参加人数
source: Tournament capacity
fr: Capacité du tournoi
ja: 最大参加人数

# トーナメント開始日
source: Tournament start date
fr: Date de début du tournoi
ja: トーナメント開始日

# フレンドに通知
source: Notify friend
fr: Notifier un ami
ja: フレンドに通知

# 参加者募集中
source: Looking for participants
fr: Recherche de participants
ja: 参加者募集中

# トーナメント進行中
source: Tournament in progress
fr: Tournoi en cours
ja: トーナメント進行中

# 終了
source: Finished
fr: Terminé
ja: 終了

# トーナメント名
source: Tournament name
fr: Nom du tournoi
ja: トーナメント名

# 開始時間
source: Start time
fr: Heure de début
ja: 開始時間

# フレンドのみ
source: Friends only
fr: Amis uniquement
ja: フレンドのみ

# エイリアス名
source: Alias name
fr: Nom d'alias
ja: エイリアス名

# 参加申し込み
source: Participant sign up
fr: Inscription des participants
ja: 参加申し込み

# 参加人数が上限に達したため、登録することができません。
source: This tournament is full. You may not sign up
fr: Ce tournoi est complet. Vous ne pouvez pas vous inscrire.
ja: 参加人数が上限に達したため、登録することができません。

# すでに登録しています。
source: You are already registered.
fr: Vous êtes déjà inscrit.
ja: すでに登録しています。

# プレイヤー名
source: Player name
fr: Nom du joueur
ja: プレイヤー名

# 参加
source: Join
fr: Rejoindre
ja: 参加

# すべての項目を表示
source: Show all
fr: Afficher tout
ja: すべての項目を表示

# 対象のトーナメントは存在しません
source: No relevant tournaments
fr: Aucun tournoi pertinent
ja: 対象のトーナメントは存在しません

# トーナメント詳細
source: Tournament details
fr: Détails du tournoi
ja: トーナメント詳細

# 登録者数
source: Number of participants
fr: Nombre de participants
ja: 登録者数

# 参加者一覧
source: Participants list
fr: Liste des participants
ja: 参加者一覧

# 参加者はいません
source: No participants
fr: Pas de participants
ja: 参加者はいません

# トーナメント表
source: Tournament chart
fr: Tableau du tournoi
ja: トーナメント表

# トーナメント作成
source: Create tournament
fr: Créer un tournoi
ja: トーナメント作成

# トーナメントの作成に失敗しました。
source: Failed to create tournament.
fr: Échec de la création du tournoi.
ja: トーナメントの作成に失敗しました。

# 過去の時間を設定することはできません。
source: You cannot set a time in the past.
fr: Vous ne pouvez pas définir une heure passée.
ja: 過去の時間を設定することはできません。

# 同じ時刻に重複して設定することもできません。
source: You also cannot set overlapping times.
fr: Vous ne pouvez pas non plus définir des heures qui se chevauchent.
ja: 同じ時刻に重複して設定することもできません。

# このダイアログを閉じてもう一度実行してください。
source: Please close the message and try again.
fr: Veuillez fermer le message et réessayer.
ja: このダイアログを閉じてもう一度実行してください。

# 開始日
source: Start day
fr: Date de début
ja: 開始日

# 作成
source: Create
fr: Créer
ja: 作成

# 参加可能トーナメント
source: Joinable tournaments
fr: Tournois disponibles
ja: 参加可能トーナメント

# 主催したトーナメント
source: Hosted tournaments
fr: Tournois organisés
ja: 主催したトーナメント

# 登録済みトーナメント
source: Registered tournaments
fr: Tournois enregistrés
ja: 登録済みトーナメント

# すべてのトーナメント
source: All tournaments
fr: Tous les tournois
ja: すべてのトーナメント

# 終了したトーナメント
source: Finished tournaments
fr: Tournois terminés
ja: 終了したトーナメント

# 入力してください。
source: Please fill in the field.
fr: Veuillez remplir le champ.
ja: 入力してください。

# ２要素認証で必要です。電話番号を入力してください
source: Necessary for 2 factor authentication. Please enter a phone number.
fr: Nécessaire pour l'authentification à deux facteurs. Veuillez entrer un numéro de téléphone.
ja: ２要素認証で必要です。電話番号を入力してください

# 現在のパスワード
source: Current password
fr: Mot de passe actuel
ja: 現在のパスワード

# 新しいパスワード
source: New password
fr: Nouveau mot de passe
ja: 新しいパスワード

# 新しいパスワード(確認用)
source: New password (confirmation)
fr: Nouveau mot de passe (confirmation)
ja: 新しいパスワード(確認用)

# 新しいパスワードは古いパスワードと同じにできません。
source: The new password must be different from the old password.
fr: Le nouveau mot de passe doit être différent de l'ancien.
ja: 新しいパスワードは古いパスワードと同じにできません。

source: Change Password
fr: Changer le mot de passe
ja: パスワード変更

# 新しいパスワード（確認用）
source: New password (confirmation)
fr: Nouveau mot de passe (confirmation)
ja: 新しいパスワード（確認用）

# 変更
source: Edit
fr: Modifier
ja: 変更

# 42OAuthでログインされたアカウントでは、ご利用できません。
source: Not applicable to accounts created by 42OAuth.
fr: Non applicable aux comptes créés par 42OAuth.
ja: 42OAuthでログインされたアカウントでは、ご利用できません。

source: Changed Password
fr: Mot de passe modifié
ja: パスワード変更

# パスワードの変更が完了しました。
source: Password change complete.
fr: La modification du mot de passe est terminée.
ja: パスワードの変更が完了しました。

source: Profile
fr: Profil

source: Edit Profile
fr: Modifier le profil

# アバター変更
source: Edit avatar
fr: Modifier l'avatar
ja: アバター変更

# 保存
source: Save
fr: Enregistrer
ja: 保存

source: Save
fr: Enregistrer

source: Exported Profile
fr: Profil exporté

# プロフィールのエクスポートが完了しました。
source: Profile export complete.
fr: L'exportation du profil est terminée.
ja: プロフィールのエクスポートが完了しました。

source: 本サービスの作成者および管理者（以下「管理者」）は、利用者の個人情報を適切に保護し、GDPR（一般データ保護規則）を遵守して取り扱います。
fr: Les créateurs et administrateurs du Service (ci-après 'l'administrateur') protègent correctement les informations personnelles des utilisateurs et respectent le RGPD (Règlement général sur la protection des données).

# 1. 収集する個人データ
source: 1. Collected Personal Data
fr: 1. Données personnelles collectées
ja: 1. 収集する個人データ

# 管理者が収集する個人データは以下の通りです：
source: The personal data collected by the administrator is as follows:
fr: Les données personnelles collectées par l'administrateur sont les suivantes:
ja: 管理者が収集する個人データは以下の通りです：

# 氏名、メールアドレス、電話番号などの連絡先情報
source: Contact information such as name, email address, and phone number.
fr: Informations de contact telles que le nom, l'adresse e-mail et le numéro de téléphone.
ja: 氏名、メールアドレス、電話番号などの連絡先情報

# アカウント作成時に提供されるユーザー情報
source: User information provided at the time of account creation.
fr: Informations fournies par l'utilisateur lors de la création du compte.
ja: アカウント作成時に提供されるユーザー情報

# その他、必要に応じて提供される情報
source: Other information provided as needed.
fr: Autres informations fournies selon les besoins.
ja: その他、必要に応じて提供される情報

# 本サービスの利用履歴や閲覧履歴
source: Usage history and browsing history of the service.
fr: Historique d'utilisation et historique de navigation du Service.
ja: 本サービスの利用履歴や閲覧履歴

# 2. 個人データの収集方法
source: 2. Methods of Collecting Personal Data
fr: 2. Méthodes de collecte des données personnelles
ja: 2. 個人データの収集方法

# 管理者は、以下の方法で利用者の個人データを収集します：
source: The administrator collects the user's personal data by the following methods:
fr: L'administrateur collecte les données personnelles de l'utilisateur par les méthodes suivantes:
ja: 管理者は、以下の方法で利用者の個人データを収集します：

# 利用者が本サービスを利用する際に自発的に提供された情報
source: Information voluntarily provided by the user when using the service
fr: Informations fournies volontairement par l'utilisateur lors de l'utilisation du service

# Cookieおよび類似の追跡技術を通じた自動的な収集
source: Automatic collection through cookies and similar tracking technologies
fr: Collecte automatique via des cookies et des technologies de suivi similaires
ja: Cookieおよび類似の追跡技術を通じた自動的な収集

# 第三者のサービスプロバイダからの情報（適用される場合）
source: Information from third-party service providers (where applicable)
fr: Informations provenant de prestataires de services tiers (le cas échéant)
ja: 第三者のサービスプロバイダからの情報（適用される場合）

# 3. 個人データの利用目的
source: 3. Purpose of Using Personal Data
fr: 3. Finalité de l'utilisation des données personnelles
ja: 3. 個人データの利用目的

# 管理者は、利用者の個人データを以下の目的で使用します：
source: The administrator uses the user's personal data for the following purposes:
fr: L'administrateur utilise les données personnelles des utilisateurs pour les finalités suivantes:
ja: 管理者は、利用者の個人データを以下の目的で使用します：

# 本サービスの提供およびカスタマイズ
source: Providing and customizing the service
fr: Fourniture et personnalisation du service
ja: 本サービスの提供およびカスタマイズ

# 利用者からの問い合わせ対応
source: Responding to user inquiries
fr: Réponse aux demandes des utilisateurs
ja: 利用者からの問い合わせ対応

# サービスの改善および新機能の開発
source: Improving the service and developing new features
fr: Amélioration du service et développement de nouvelles fonctionnalités
ja: サービスの改善および新機能の開発

# 法的義務の遵守およびコンプライアンス
source: Compliance with legal obligations and regulations
fr: Respect des obligations légales et de la conformité
ja: 法的義務の遵守およびコンプライアンス

# マーケティングおよびプロモーション（お客様の同意を得た場合）
source: Marketing and promotions (with user consent)
fr: Marketing et promotions (avec le consentement de l'utilisateur)
ja: マーケティングおよびプロモーション（お客様の同意を得た場合）

# 4. データの保存期間
source: 4. Data Retention Period
fr: 4. Durée de conservation des données
ja: 4. データの保存期間

# 管理者は、収集した個人データを、その利用目的を達成するために必要な期間に限り保持します。
source: The administrator will retain the collected personal data only for the period necessary to achieve the purpose of its use.
fr: L'administrateur conserve les données personnelles collectées uniquement pour la durée nécessaire à la réalisation de la finalité de leur utilisation.
ja: 管理者は、収集した個人データを、その利用目的を達成するために必要な期間に限り保持します。

# 法的に定められた保存期間を超えて保持する必要がある場合は、その限りではありません。
source: However, this does not apply if it is necessary to retain the data beyond the legally stipulated retention period.
fr: Cependant, cela ne s'applique pas si les données doivent être conservées au-delà de la période de conservation légalement stipulée.
ja: 法的に定められた保存期間を超えて保持する必要がある場合は、その限りではありません。

# 5. 個人データの第三者提供
source: 5. Provision of Personal Data to Third Parties
fr: 5. Fourniture des données personnelles à des tiers
ja: 5. 個人データの第三者提供

# 管理者は、以下の場合を除き、利用者の個人データを第三者に提供しません：
source: The administrator will not provide the user's personal data to third parties except in the following cases:
fr: L'administrateur ne fournira pas les données personnelles des utilisateurs à des tiers, sauf dans les cas suivants:
ja: 管理者は、以下の場合を除き、利用者の個人データを第三者に提供しません：

# 法的義務を果たすために必要な場合
source: When necessary to fulfill legal obligations
fr: Lorsque cela est nécessaire pour remplir des obligations légales
ja: 法的義務を果たすために必要な場合

# 利用者の同意を得た場合
source: When user has consented
fr: Lorsque l'utilisateur a donné son consentement
ja: 利用者の同意を得た場合

# サービスプロバイダに業務委託する場合（例：サーバーホスティング、支払い処理など）
source: When outsourcing services to service providers (e.g., server hosting, payment processing, etc.)
fr: Lors de la sous-traitance à des prestataires de services (ex: hébergement de serveurs, traitement des paiements, etc.)
ja: サービスプロバイダに業務委託する場合（例：サーバーホスティング、支払い処理など）

# 6. Cookieおよび追跡技術
source: 6. Cookies and Tracking Technologies
fr: 6. Cookies et technologies de suivi
ja: 6. Cookieおよび追跡技術

# 管理者は、ウェブサイトの利便性向上目的でCookieを使用しています。
source: The administrator uses cookies to improve the convenience of the website.
fr: L'administrateur utilise des cookies pour améliorer la convivialité du site.
ja: 管理者は、ウェブサイトの利便性向上目的でCookieを使用しています。

# Cookieは、セキュリティー、ネットワーク管理、アクセシビリティー等の機能を有効にします。
source: Cookies enable functionalities such as security, network management, and accessibility.
fr: Les cookies activent des fonctionnalités telles que la sécurité, la gestion du réseau et l'accessibilité.
ja: Cookieは、セキュリティー、ネットワーク管理、アクセシビリティー等の機能を有効にします。

# ユーザはブラウザの設定の変更によりこれを無効にすることができますが、それにより本サービスの機能が影響を受ける可能性があります。
source: Users can disable this by changing their browser settings, but this may affect the functionality of the service.
fr: Les utilisateurs peuvent désactiver cela en modifiant les paramètres de leur navigateur, mais cela peut affecter la fonctionnalité du service.
ja: ユーザはブラウザの設定の変更によりこれを無効にすることができますが、それにより本サービスの機能が影響を受ける可能性があります。

# 7. 利用者の権利
source: 7. User Rights
fr: 7. Droits des utilisateurs
ja: 7. 利用者の権利

# 利用者は、以下の権利を有します：
source: Users have the following rights:
fr: Les utilisateurs disposent des droits suivants:
ja: 利用者は、以下の権利を有します：

# 個人データへのアクセス権
source: The right to access personal data
fr: Le droit d'accès aux données personnelles
ja: 個人データへのアクセス権

# 個人データの訂正権
source: The right to correct personal data
fr: Le droit de rectifier les données personnelles
ja: 個人データの訂正権

# 個人データの削除権（「忘れられる権利」）
source: The right to delete personal data
fr: Le droit de supprimer des données personnelles
ja: 個人データの削除権（「忘れられる権利」）

# データ処理の制限を求める権利
source: The right to request restrictions on data processing
fr: Le droit de demander la limitation du traitement des données
ja: データ処理の制限を求める権利

# データポータビリティの権利
source: The right to data portability
fr: Le droit à la portabilité des données
ja: データポータビリティの権利

# 処理に対する異議の権利
source: The right to object to processing
fr: Le droit de s'opposer au traitement des données
ja: 処理に対する異議の権利

# 同意の撤回権（同意に基づく処理の場合）
source: The right to withdraw consent (if the data processing is based on consent)
fr: Le droit de retirer son consentement (si le traitement des données est basé sur le consentement)
ja: 同意の撤回権（同意に基づく処理の場合）

# 権利の行使を希望する場合は、下記の連絡先までご連絡ください。
source: If you wish to exercise any of your rights, please contact us at the contact address listed below.
fr: Si vous souhaitez exercer l'un de vos droits, veuillez nous contacter à l'adresse ci-dessous.
ja: 権利の行使を希望する場合は、下記の連絡先までご連絡ください。

# 8. 個人データの保護
source: 8. Protection of Personal Data
fr: 8. Protection des données personnelles
ja: 8. 個人データの保護

# 管理者は、適切な技術的および組織的な措置を講じ、個人データを不正なアクセス、紛失、改ざん、漏洩から保護します。
source: The administrator will take appropriate technical and organizational measures to protect personal data from unauthorized access, loss, alteration, and leakage.
fr: L'administrateur prendra les mesures techniques et organisationnelles appropriées pour protéger les données personnelles contre l'accès non autorisé, la perte, la modification et la fuite.
ja: 管理者は、適切な技術的および組織的な措置を講じ、個人データを不正なアクセス、紛失、改ざん、漏洩から保護します。

# 9. プライバシーポリシーの変更
source: 9. Changes to the Privacy Policy
fr: 9. Modifications de la politique de confidentialité
ja: 9. プライバシーポリシーの変更

# 管理者は、必要に応じて本プライバシーポリシーを改定することがあります。変更があった場合には、本ページにて通知いたします。
source: The administrator may revise this privacy policy as necessary.In the event of changes, notifications will be made on this page.
fr: L'administrateur peut réviser cette politique de confidentialité si nécessaire. En cas de modifications, des notifications seront faites sur cette page.
ja: 管理者は、必要に応じて本プライバシーポリシーを改定することがあります。変更があった場合には、本ページにて通知いたします。
